<template>
  <div class="p-2">
    <textarea
        ref="textarea"
        :value="text"
        resize="none"
        class="outline-none border border-amber-900 rounded w-full p-1"
        placeholder="Введите текст для прописи"
        @input="updateText($event.target.value)"
    ></textarea>
  </div>
</template>

<script setup>
import {ref, onMounted } from "vue";
import { useStore } from 'vuex'

const store = useStore()
const textarea = ref(null)

const text = ref(`Очевидно, что аллегория вероятна. Олицетворение, соприкоснувшись в чем-то со своим главным антагонистом в постструктурной поэтике, постоянно.

Одиннадцатисложник, на первый взгляд, разрушаем. Модальность высказывания семантически диссонирует зачин.

Не-текст редуцирует глубокий цикл. Метонимия отталкивает палимпсест. Сумароковская школа возможна.

Заимствование выбирает резкий дольник. Лирический субъект жизненно дает деструктивный стиль. Декодирование представляет собой возврат к стереотипам. Аллегория аллитерирует поэтический композиционный анализ. Синхрония нивелирует культурный механизм сочленений.
Очевидно, что аллегория вероятна. Олицетворение, соприкоснувшись в чем-то со своим главным антагонистом в постструктурной поэтике, постоянно.

Одиннадцатисложник, на первый взгляд, разрушаем. Модальность высказывания семантически диссонирует зачин.

Не-текст редуцирует глубокий цикл. Метонимия отталкивает палимпсест. Сумароковская школа возможна.

Заимствование выбирает резкий дольник. Лирический субъект жизненно дает деструктивный стиль. Декодирование представляет собой возврат к стереотипам. Аллегория аллитерирует поэтический композиционный анализ.`)

onMounted (() => {
  store.commit('setText', text)
  autoResize()
})

function updateText (newText) {
  text.value = newText
  store.commit('setText', newText)

  autoResize()
}

const autoResize = () => {
  textarea.value.style.height = 'auto';
  textarea.value.style.height = (textarea.value.scrollHeight + 10) + 'px';
};
</script>
